[
  {
    "avatar": "/img/SpeakerImages/Denis.png",
    "title": "Intro to the HPE Ezmeral Container Platform REST API",
    "desc": "Calling all developers, data analysts and IT architects. Learn how to interact with the HPE Ezmeral Container Platform programmatically through its REST API. In this hands-on workshop, you'll learn how to perform authentication, deploy distributed multi-mode applications for AI/ML and data analytics and interpret/respond to REST API calls. We'll walk you through, step by step, and, by the end of the session, you'll be deploying a TensorFlow application framework and other simple applications. No previous programming experience required.",
    "presenter": "Denis Choukroun",
    "role": "Cloud Solution Architect",
    "videolink": "https://vimeo.com/445302013",
    "id": 0
  },
  {
    "avatar": "/img/SpeakerImages/chris-hpecp.jpg",
    "title": "Automate Apps With the HPE Container Platform",
    "desc": "IT administrators are frequently challenged to stand up hardware and software environments. These requests can be time-consuming and confusing for non-technical teams to deploy. By implementing the HPE Ezmeral Container Platform with its easy-to-use APIs, new clusters and software applications can be created automatically with specified resources. Join this hands-on workshop to learn how the HPE Ezmeral Container Platform APIs make it easier to configure apps and compute resources, along with how to pull detailed usage reports for chargeback/showback.",
    "presenter": "Chris Crawford",
    "role": "Solutions Architect",
    "videolink": "https://vimeo.com/445267000",
    "id": 1
  },
  {
    "avatar": "/img/SpeakerImages/michael.jpeg",
    "title": "Using the CSI with HPE Ezmeral Container Platform",
    "desc": "This hands-on workshop explores the fundamentals of persistent storage in Kubernetes from an end-user perspective. Learn how to create persistent volume claims (PVC), snapshots and clones, resize volumes, attach raw block volumes and understand the properties of StorageClass objects and working with PVC annotations to tweak behavior of the underlying storage to optimize performance for different workload types. Prior Kubernetes knowledge is helpful, but not necessary as the instructor will walk through different examples during the session.",
    "presenter": "Michael Mattsson",
    "role": "Principal Tech Marketing Engineer",
    "videolink": "https://vimeo.com/436874235",
    "id": 2
  },
  {
    "avatar": "/img/SpeakerImages/sandeep.jpeg",
    "title": "Deploying End-to-End Machine Learning Workflows",
    "desc": "Join this hands-on workshop and learn some fundamentals of the HPE Ezmeral Container Platform’s ability to manage, deploy and work with models in a notebook oriented around machine learning, model development and management. You will understand how to securely deploy and update your models in a containerized workload using data in the global data fabric and applications loaded on the HPE Ezmeral Container Platform.",
    "presenter": "Sandeep Deshmukh",
    "role": "Product Manager",
    "videolink": "https://vimeo.com/445001242",
    "id": 3
  },
  {
    "avatar": "/img/SpeakerImages/madhu_wali.jpg",
    "title": "SPIFFE and SPIRE Fundamentals",
    "desc": "Inspired by production infrastructure at Facebook, Google, Netflix and more, SPIFFE is a set of open-source standards for securely authenticating software services in dynamic and heterogeneous environments through the use of platform-agnostic, cryptographic identities. SPIRE is an open-source system that implements the SPIFFE specification in a wide variety of environments. This workshop covers SPIFFE fundamentals and provides a walk-through of installing components that make up a SPIRE deployment and demonstrates its functionality in action.",
    "presenter": "Madhukesh Wali",
    "role": "Solution Architect",
    "videolink": "https://vimeo.com/445001005",
    "id": 4
  },
  {
    "avatar": "/img/SpeakerImages/madhu_wali.jpg",
    "title": "Enabling PKI-Based Database Authentication With SPIRE",
    "desc": "This workshop will showcase how you can use SPIRE-issued identities (specialized X.509 certificates based on SPIFFE) to directly authenticate to databases using their standard, built-in PKI authentication. This approach does not rely on hardcoded passwords or secrets in general. Instead, short-lived asymmetric keys encrypt all traffic to the database, so it's secure even if your network is compromised.",
    "presenter": "Madhukesh Wali",
    "role": "Solution Architect",
    "videolink": "https://vimeo.com/445001105",
    "id": 5
  },
  {
    "avatar": "/img/SpeakerImages/madhu_wali.jpg",
    "title": "Strengthening Envoy Authentication With SPIRE",
    "desc": "Envoy is a popular open-source service proxy. SPIRE provides a system for establishing trust between software services, without necessarily using secrets or network-based security controls. In this workshop, you learn how to use SPIRE with Envoy to provide secure, authenticated mTLS connectivity between services with frequently rotated X.509 certificates and keys.",
    "presenter": "Madhukesh Wali",
    "role": "Solution Architect",
    "videolink": "https://vimeo.com/445001183",
    "id": 6
  },
  {
    "avatar": "/img/SpeakerImages/Didier.png",
    "title": "Hack Shack Challenges: Are You Ready to Compete?",
    "desc": "Feeling competitive? Show off your coding chops in any of our four challenges to compete for cool prizes. Attend this summary session to learn how to register for the challenges. We’ll explain each one, go over the rules and walk you through the environment you’ll be working in. You’ll have four hours in which to complete each challenge. Never tried any of our challenges before and wonder if it’s for you? Join us on our Slack channel (https://hpedev.slack.com/archives/C015CLE2QTT) so you can reach out to us with any questions.",
    "presenter": "Didier Lalli",
    "role": "Distinguished Technologist",
    "videolink": "https://vimeo.com/434425665",
    "id": 7
  },
  {
    "avatar": "/img/SpeakerImages/vincent.jpeg",
    "title": "Introduction to the HPE OneView REST API",
    "desc": "Get some practical experience with the HPE OneView REST API. Learn how to talk to an HPE OneView appliance by building a request in PowerShell, Python or even implementing a raw request with curl. In this hands-on workshop, we’ll teach you how to write your own 'infrastructure-as-code', step by step, in an interactive way. You’ll learn how to gather information from HPE OneView and even how to perform configuration tasks, such as provisioning a new server.",
    "presenter": "Vincent Berger",
    "role": "Solutions Architect",
    "videolink": "https://vimeo.com/445000851",
    "id": 8
  },
  {
    "avatar": "/img/SpeakerImages/Didier.png",
    "title": "API 101, API Basics and the Value They Provide",
    "desc": "You may know that application programming interfaces (APIs) allow applications to talk to other apps, but have you ever used them? Today, APIs are available for most products and solutions. You can take advantage of them when writing automation scripts, integrating code or defining infrastructure-as-code, as long as you understand the mechanisms used to consume an API. In this hands-on workshop, we'll review all the jargon and technology used by REST APIs and show you how to place your first API call against a publicly available API.",
    "presenter": "Didier Lalli",
    "role": "Distinguished Technologist",
    "videolink": "https://vimeo.com/445266623",
    "id": 9
  },
  {
    "avatar": "/img/SpeakerImages/Francois.png",
    "title": "Redfish API Use With PowerShell Python and Bash/cURL",
    "desc": "DMTF's Redfish is a standard designed to deliver simple and secure management for converged, hybrid IT and the Software-Defined Data Center (SDDC). Today it is rapidly replacing proprietary protocols. In this hands-on workshop, you'll get to explore the Redfish tree of an OpenBMC and HPE iLO 5 to understand its basic structure, and learn how to modify resources and perform simple actions. You'll interact with the HTTP/JSON-based standard using your favorite language, whether it's PowerShell, Python or Bash/cURL. Beginners and experts welcome.",
    "presenter": "Francois Donze",
    "role": "Technical Consultant",
    "videolink": "https://vimeo.com/445266806",
    "id": 10
  },
  {
    "avatar": "/img/SpeakerImages/joe-aruba.jpg",
    "title": "Use Aruba API Yourself",
    "desc": "Get your automation game on with Aruba APIs in this Hands-on Lab session covering Aruba's wired and wireless portfolio. In this workshop, you'll learn to manage, configure and automate Aruba products using their REST APIs, and move away from slow and error-prone CLI (command line interface) work. We're offering a collection of labs tailored to varying skill levels, from coding new-comers to hardcore Pythonistas and everyone in-between. No experience required.",
    "presenter": "Joe Neville",
    "role": "Strategist",
    "videolink": "https://vimeo.com/445266722",
    "id": 11
  },
  {
    "avatar": "/img/SpeakerImages/hana.jpg",
    "title": "AI 101, Convolutional Neural Network (CNN) for MNIST",
    "desc": "Whether its facial recognition or self-driving cars, CNNs are used everywhere. Join this hands-on workshop to learn how to implement a simple CNN for a Modified National Institute of Standards and Technology database (MNIST). Using an MNIST dataset (70,000 pictures of hand-written digits) you'll learn how to build a simple CNN and train it to solve a real problem with Keras (a deep learning library for Python.) On completion, you'll be able to predict a digit, given a picture of hand-written digits with 99% accuracy.",
    "presenter": "Hana Malha",
    "role": "Machine Learning Engineer",
    "videolink": "https://vimeo.com/445266905",
    "id": 12
  },
  {
    "avatar": "/img/SpeakerImages/ron.jpg",
    "title": "Simple Automation Script With HPE SimpliVity REST API",
    "desc": "HPE SimpliVity HCI (hyperconverged infrastructure) helps to simplify complexity and to reduce your data center footprint. In this hands-on workshop, we’ll show you how to automate business processes by combining the HPE SimpliVity REST API with other tools. We’ll introduce you to several available modules, including PowerShell, Python, Go, Ansible, Terraform and more. We’ll even walk through some examples of HPE SimpliVity and VMware using Jupyter Notebooks. No previous programming experience required.",
    "presenter": "Ron Dharma",
    "role": "Principal Tech Marketing Engineer",
    "videolink": "https://vimeo.com/436858869",
    "id": 13
  },
  {
    "avatar": "/img/SpeakerImages/pramod.png",
    "title": "Streamline app development with open source Grommet",
    "desc": "Ever wanted to develop your own app in a easy way? Come and join us at this 101 Session on grommet, an open source project led by HPE. Grommet is a react-based framework that provides accessibility, modularity, responsiveness, and theming in a tidy package. This session will allow you to discover the basics and deploy your first app on Netifly!",
    "presenter": "Pramod Sareddy",
    "role": "Fullstack Developer",
    "videolink": "https://vimeo.com/461431097",
    "id": 14
  },
  {
    "avatar": "/img/SpeakerImages/Didier.png",
    "title": "Introduction to Python programming",
    "desc": "Are you interested in learning more about Python, the high-level, general-purpose programming language? This basic 101-level course will get you started. Begin with a simple Hello World example and move to loops, dict and tuples concepts. Learn to use Python language constructs and an object-oriented approach to write clear, logical code for small and large-scale projects.",
    "presenter": "Samarth Deyagond & Didier Lalli",
    "role": "Distinguished Technologist",
    "videolink": "https://vimeo.com/472124807",
    "id": 15
  },
  {
    "title": "Introduction to Rust programming",
    "desc": "Hundreds of companies around the world are using Rust in production today for fast, low-resource, cross-platform solutions. Software you know and love, like Firefox, Dropbox, and Cloudflare, uses Rust. From startups to large corporations, from embedded devices to scalable web services, Rust is a great fit. In this session we will introduce the audience to Rust programming. A language empowering everyone to build reliable and efficient software.",
    "presenter": "Jonathan Parris & Thomas Malachi",
    "role": "Fullstack Developer",
    "videolink": "https://vimeo.com/472125189",
    "id": 16
  },
  {
    "avatar": "/img/SpeakerImages/Didier.png",
    "title": "Git101 - Getting involved in the open source community",
    "desc": "Git, the most widely-used version control system, and its associated web-based repositories, Github and Gitlab, are critical elements of today’s DevOps practices. If you want to be an open source developer, being able to navigate your way through the Git command set is a must. In this hands-on workshop, we’ll review some of the most common use cases. You’ll create your own Github account and begin using it to collaborate with others. You’ll learn to access material from other members, contribute to projects, and even create your own project.",
    "presenter": "Didier Lalli",
    "role": "Distinguished Technologist",
    "videolink": "https://vimeo.com/480875742",
    "id": 17
  }
  
]