[
  {
  "sessionId": "W479",
  "sessionType": "Workshop",
  "avatar": "/img/SpeakerImages/Denis.png",
  "title": "Intro to the HPE Container Platform REST API",
  "desc": "Calling all developers, data analysts and IT architects. Learn how to interact with the HPE Container Platform programmatically through its REST API. In this hands-on workshop, you’ll learn how to perform authentication, deploy distributed multi-mode applications for AI/ML and data analytics and interpret/respond to REST API calls. We’ll walk you through, step by step, and, by the end of the session, you’ll be deploying a TensorFlow application framework and other simple applications. No previous programming experience required.",
  "presenter": "Denis Choukroun",
  "role": "Cloud Solution Architect",
  "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sf=4880&locale=en_US"
  },
  {
  "sessionId": "W652",
  "sessionType": "Workshop",
  "avatar": "/img/SpeakerImages/michael.jpeg",
  "title": "Using the CSI with HPE Ezmeral Container Platform",
  "desc": "This hands-on workshop explores the fundamentals of persistent storage in Kubernetes from an end-user perspective. Learn how to create persistent volume claims (PVC), snapshots and clones, resize volumes, attach raw block volumes and understand the properties of StorageClass objects and working with PVC annotations to tweak behavior of the underlying storage to optimize performance for different workload types. Prior Kubernetes knowledge is helpful, but not necessary as the instructor will walk through different examples during the session.",
  "presenter": "Michael Mattsson",
  "role": "Principal Tech Marketing Engineer",
  "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sid=21652_9708&locale=en_US"
  },
  {
    "sessionId": "W686",
    "sessionType": "Workshop",
    "avatar": "/img/SpeakerImages/sandeep.jpeg",
    "title": "Deploying End-to-End Machine Learning Workflows",
    "desc": "Join this hands-on workshop and learn some fundamentals of the HPE Ezmeral Container Platform’s ability to manage, deploy and work with models in a notebook oriented around machine learning, model development and management. You will understand how to securely deploy and update your models in a containerized workload using data in the global data fabric and applications loaded on the HPE Ezmeral Container Platform.",
    "presenter": "Sandeep Deshmukh",
    "role": "Product Manager",
    "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sf=4876&locale=en_US"
    },
    {
      "sessionId": "W682",
      "sessionType": "Workshop",
      "avatar": "/img/SpeakerImages/vincent.jpeg",
      "title": "Introduction to the HPE OneView REST API",
      "desc": "Get some practical experience with the HPE OneView REST API. Learn how to talk to an HPE OneView appliance by building a request in PowerShell, Python or even implementing a raw request with curl. In this hands-on workshop, we’ll teach you how to write your own infrastructure-as-code, step by step, in an interactive way. You’ll learn how to gather information from HPE OneView and even how to perform configuration tasks, such as provisioning a new server.",
      "presenter": "Vincent Berger",
      "role": "Solutions Architect",
      "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sf=4881&locale=en_US"
      },
  {
  "sessionId": "W683",
  "sessionType": "Workshop",
  "avatar": "/img/SpeakerImages/madhu_wali.jpg",
  "title": "SPIFFE and SPIRE Fundamentals",
  "desc": "Inspired by production infrastructure at Facebook, Google, Netflix and more, SPIFFE is a set of open-source standards for securely authenticating software services in dynamic and heterogeneous environments through the use of platform-agnostic, cryptographic identities. SPIRE is an open-source system that implements the SPIFFE specification in a wide variety of environments. This workshop covers SPIFFE fundamentals and provides a walk-through of installing components that make up a SPIRE deployment and demonstrates its functionality in action.",
  "presenter": "Madhukesh Wali",
  "role": "Product Manager",
  "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sf=4879&locale=en_US"
  },
  {
  "sessionId": "W684",
  "sessionType": "Workshop",
  "avatar": "/img/SpeakerImages/madhu_wali.jpg",
  "title": "Enabling PKI-Based Database Authentication With SPIRE",
  "desc": "This workshop will showcase how you can use SPIRE-issued identities (specialized X.509 certificates based on SPIFFE) to directly authenticate to databases using their standard, built-in PKI authentication. This approach does not rely on hardcoded passwords or secrets in general. Instead, short-lived asymmetric keys encrypt all traffic to the database, so it's secure even if your network is compromised.",
  "presenter": "Madhukesh Wali",
  "role": "Product Manager",
  "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sf=4878&locale=en_US"
  },
  {
  "sessionId": "W685",
  "sessionType": "Workshop",
  "avatar": "/img/SpeakerImages/madhu_wali.jpg",
  "title": "Strengthening Envoy Authentication With SPIRE",
  "desc": "Envoy is a popular open-source service proxy. SPIRE provides a system for establishing trust between software services, without necessarily using secrets or network-based security controls. In this workshop, you learn how to use SPIRE with Envoy to provide secure, authenticated mTLS connectivity between services with frequently rotated X.509 certificates and keys.",
  "presenter": "Madhukesh Wali",
  "role": "Product Manager",
  "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sf=4882&locale=en_US"
  },
  {
    "sessionId": "T490",
    "sessionType": "Session",
    "avatar": "/img/SpeakerImages/arti.png",
    "title": "Demystifying AI Technology Choices",
    "desc": "When organizations adopt AI, they face a number of challenges ranging from cross-functional stakeholders, to shifting business processes, to a complex landscape of technologies. This latter challenge alone can stymie AI initiatives, as organizations struggle to make decisions about investing in the right technologies to serve their needs. In this session, we’ll discuss how breaking down an AI solution into workflow steps can help system administrators, data scientists and business leaders better understand the AI technology landscape.",
    "presenter": "Arti Garg",
    "role": "Head of Advanced AI Solutions & Technologies",
    "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sf=1607&locale=en_US"
  },
  {
    "sessionId": "T491",
    "sessionType": "Session",
    "avatar": "/img/SpeakerImages/glyn.png",
    "title": "What Data Scientists Can Learn From Software Developers",
    "desc": "Developers have been building best practices since the first programs were written, culminating in the DevOps movement. There is plenty to learn about building software on which critical workloads depend (e.g., building resilience or simply accelerating testing and experimentation). We will look at the parallels between the two disciplines, highlighting areas where one can build upon the work of the other and how HPE Container Platform makes that process simpler and more accessible with MLOps.",
    "presenter": "Glyn Bowden",
    "role": "Chief Architect, AI & Data Science",
    "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sf=1605&locale=en_US"
  },
  {
    "sessionId": "T492",
    "sessionType": "Session",
    "avatar": "/img/SpeakerImages/nanda.png",
    "title": "Accelerate Innovation With DevOps for Machine Learning",
    "desc": "Accelerating innovation and delivering faster time-to-value for AI initiatives while ensuring enterprise-grade security and high performance is today’s challenge. To ensure success, you’ll need to provide access to the tools and data your data scientist needs for large-scale distributed ML and DL, delivering greater agility for rapid prototyping, iteration and deployment. Join this session to learn to how to spin up containerized multi-node environments to train models in a multi-tenant architecture, be it on-premises or in cloud environments.",
    "presenter": "Nanda Vijaydev",
    "role": "Distinguished Technologist, Lead Data Scientist",
    "link": "https://content.attend.hpe.com/go/agendabuilder.sessions/?l=1043&sf=1606&locale=en_US"
  }
  ]
  